diapos/RadiacionSolar_Formulas.org
#+TITLE: Prontuario de Fórmulas
#+SUBTITLE: Radiación Solar
#+STARTUP: indent
#+AUTHOR:    [[https://oscarperpinan.github.io][Oscar Perpiñán Lamigueiro]]
#+DATE:
#+LANGUAGE:  es
#+OPTIONS:   H:2 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LaTeX_CLASS: memoir-article
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage{mathpazo} 
#+LATEX_HEADER: \usepackage[emulate=units]{siunitx}
#+LATEX_HEADER: \newunit{\wattpeak}{Wp}
#+LATEX_HEADER: \newunit{\watthour}{Wh}
#+LATEX_HEADER: \newunit{\amperehour}{Ah}
#+LATEX_HEADER: \sisetup{fraction=nice, decimalsymbol=comma, retain-unity-mantissa = false}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=black, urlcolor=black}

* Geometría Sol y Tierra
** Declinación
- Ecuación de Cooper 
 \[\delta=23,45\degree\cdot\sin\left(\frac{2\pi\cdot\left(d_{n}+284\right)}{365}\right)\]
** Hora Solar
- Criterio de signos: $w < 0$ antes del mediodía.
- 1h = 15º ($24\text{h} = 2\pi \text{ radians} = 360$)
- (Horas) $-12, -11, -10, \dots, -1, \textbf{0}, 1, \dots, 10, 11, 12$

** Amanecer
#+BEGIN_EXPORT latex
\[
\cos(\omega_{s}) = -\tan(\delta)\tan(\phi)
\]
#+END_EXPORT

** Longitud del día
#+begin_export latex
\[
|2 \cdot \omega_s  |
\]
#+end_export

** Cenit Solar

#+BEGIN_EXPORT latex
\[
\cos(\theta_{zs}) = \cos(\delta) \cos(\omega) \cos(\phi) + \sin(\delta) \sin(\phi)
\]
#+END_EXPORT

** Azimut solar

#+BEGIN_EXPORT latex
\[
  \cos(\psi_{s}) = \mathrm{sign}(\phi) \cdot \frac{\cos(\delta) \cos(\omega) \sin(\phi) - \cos(\phi) \sin(\delta)} {\sin(\theta_{z})}
\]
#+END_EXPORT
** Hora solar y Hora Oficial

\[\omega=15\cdot(\mathrm{TO}-\mathrm{AO}-12)+\Delta\lambda+\frac{\mathrm{EoT}}{4}\]

** Ecuación del Tiempo

#+BEGIN_EXPORT latex
\[
\mathrm{EoT}=229.18\cdot\left(-0.0334\cdot\sin(M)+0.04184\cdot\sin\left(2\cdot
      M+3.5884\right)\right)
\]
\[
M=\frac{2\pi}{365.24}\cdot d_{n}
\]
#+END_EXPORT



* Radiación Extra-atmosférica

- Constante solar $B_{0}=\SI{1367}{\watt\per\meter\squared}$

- Irradiancia extra-atmosférica

  #+BEGIN_EXPORT latex
  \[B_{0}(0)=B_{0}\cdot\epsilon_{0}\cdot\cos\theta_{zs}\]
  #+END_EXPORT

- Irradiación extra-atmosférica diaria  ($\omega_{s}$ en radianes)
  #+BEGIN_EXPORT latex
  \[
    B_{0d}(0)=-\frac{24}{\pi}B_{0}\epsilon_{0}\cdot\left(\omega_{s}\sin\phi\sin\delta+\cos\delta\cos\phi\sin\omega_{s}\right)
  \]
  #+END_EXPORT

- Factor de corrección por excentricidad
  #+BEGIN_EXPORT latex
  \[\epsilon_0 = 1+0,033\cdot\cos(2\pi d_n/365)\]
  #+END_EXPORT

      
- Días promedio

| Mes | Ene | Feb | Mar | Abr | May | Jun | Jul | Ago | Sep | Oct | Nov | Dic |
|-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----|
| d_n |  17 |  45 |  74 | 105 | 135 | 161 | 199 | 230 | 261 | 292 | 322 | 347 |


* Radiación solar en la superficie terrestre
** Caracterización de la atmósfera

-  Masa de aire

#+begin_export latex
\[
   M \simeq 1/\cos\theta_{zs}
\]
#+end_export

-  Índice de claridad (mensual)
#+begin_export latex
\[
K_{Tm}=\frac{G_{d,m}(0)}{B_{0d,m}(0)}
\]
#+end_export

-  Índice de claridad (diario)
#+begin_export latex
\[
K_{Td}=\frac{G_d(0)}{B_{0d}(0)}
\]
#+end_export

** Estimación de Directa y Difusa

-  Fracción de difusa
#+begin_export latex
\[
F_{D}=\frac{D(0)}{G(0)}
\]
#+end_export

- Ecuación de Page (medias mensuales)

#+begin_export latex
\[
F_{Dm}=1-1.13\cdot K_{Tm}
\]
#+end_export
- Ecuación de Collares-Pereira y Rabl (valores diarios)

#+BEGIN_EXPORT latex
\[
F_{Dd} = \begin{cases}
  0.99 & K_{Td} \leq 0.17\\
  1.188 - 2.272 \cdot K_{Td} + 9.473 \cdot K_{Td}^{2} - 21.856 \cdot K_{Td}^{3} + 14.648 \cdot K_{Td}^{4} & K_{Td} > 0.17
\end{cases}
\]
#+END_EXPORT
* Bases de Datos

** Límites Físicos

#+BEGIN_EXPORT latex
\[
  K_{dT} \leq 1
\]

\[
G_d(0) \leq B_{0d}(0)
\]
#+END_EXPORT

#+BEGIN_EXPORT latex
  \[
  K_t = \frac{G_d(0)}{B_{0d}(0)} \geq 0.03
  \]
#+END_EXPORT

** Análisis Estadístico de las Desviaciones

#+BEGIN_EXPORT latex
  \[
  MBD = \frac{1}{n} \sum_{i=1}^n (d_i)
  \]
#+END_EXPORT

#+BEGIN_EXPORT latex
  \[
  RMSD = \sqrt{\frac{1}{n} \sum_{i=1}^n d_i^2} 
  \]
#+END_EXPORT

#+BEGIN_EXPORT latex
  \[
  MAD = \frac{1}{n} \sum_{i=1}^n \left|d_i\right| 
  \]
#+END_EXPORT
* Radiación Solar en Generadores FV
** Irradiancia a partir de irradiación diaria
#+BEGIN_EXPORT latex
\[D(0) = r_D \cdot D_{d}(0)\]

\[G(0) = r_G \cdot G_{d}(0)\]
#+END_EXPORT

#+BEGIN_EXPORT latex
\[
r_D = \frac{\pi}{24}\cdot\frac{\cos(\omega)-\cos(\omega_{s})}{\omega_{s}\cdot\cos(\omega_{s})-\sin(\omega_{s})}
\]
#+END_EXPORT

#+BEGIN_EXPORT latex
\[r_{G}=r_{D}\cdot\left(a+b\cdot\cos(\omega)\right)\]

\[a=0.409-0.5016\cdot\sin(\omega_{s}+\frac{\pi}{3})\]

\[b=0.6609+0.4767\cdot\sin(\omega_{s}+\frac{\pi}{3})\]
#+END_EXPORT
** Ángulo de incidencia en sistemas fotovoltaicos
- Sistema estático ($\alpha=0$)
#+BEGIN_EXPORT latex
\[
\cos(\theta_{s}) = \cos(\delta)\cos(\omega)\cos(\beta-|\phi|)- \mathrm{sign}(\phi)\cdot\sin(\delta)\sin(\beta-|\phi|)
\]
#+END_EXPORT

- Seguidor 1x horizontal N-S 
#+begin_export latex
\[\cos(\theta_{s})=\cos(\delta)\sqrt{\sin^{2}(\omega)+\left(\cos(\omega)\cos(\phi)+\tan(\delta)\sin(\phi)\right)^{2}}\]
#+end_export

- Seguidor 2x
#+begin_export latex
\[
  \cos(\theta_{s}) = 1
\]
#+end_export

** Transformación al plano del generador


*** Irradiancia Directa

#+BEGIN_EXPORT latex
\[B(\beta,\alpha)=B(0)\cdot\frac{\max(0,\cos(\theta_{s}))}{\cos(\theta_{zs})}\]
#+END_EXPORT

*** Irradiancia Difusa
  
**** Modelo isotrópico

#+BEGIN_EXPORT latex
\[D(\beta,\alpha)=D(0)\cdot\frac{1+\cos(\beta)}{2}\]
#+END_EXPORT


**** Modelo anisotrópico
#+BEGIN_EXPORT latex
\[D(\beta,\alpha) = D^{I}(\beta,\alpha)+D^{C}(\beta,\alpha)\]

\[D^{I}(\beta,\alpha) = D(0) \cdot (1-k_{1}) \cdot \frac{1 + \cos(\beta)}{2}\]

\[D^{C}(\beta,\alpha) = D(0) \cdot k_{1} \cdot \frac{\max(0,\cos(\theta_{s}))}{\cos(\theta_{zs})}\]

\[k_{1} = \frac{B(0)}{B_{0}(0)}\]
#+END_EXPORT

*** Irradiancia de Albedo
#+BEGIN_EXPORT latex
\[R(\beta,\alpha)=\rho\cdot G(0)\cdot\frac{1-\cos(\beta)}{2}\]

\[\rho=0.2\]
#+END_EXPORT

*** Irradiancia Global
#+begin_export latex
\[
G(\beta, \alpha) = B(\beta, \alpha) + D(\beta, \alpha) + G(\beta, \alpha)
\]
#+end_export
