diapos/RadiacionSolar_Formulas.tex
% Created 2020-01-24 vie 10:11
% Intended LaTeX compiler: pdflatex
\documentclass[article, a4paper]{memoir}
	    \counterwithout{section}{chapter}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage[spanish]{babel}
\usepackage{mathpazo}
\usepackage[emulate=units]{siunitx}
\newunit{\wattpeak}{Wp}
\newunit{\watthour}{Wh}
\newunit{\amperehour}{Ah}
\sisetup{fraction=nice, decimalsymbol=comma, retain-unity-mantissa = false}
\hypersetup{colorlinks=true, linkcolor=black, urlcolor=black}
\author{\href{https://oscarperpinan.github.io}{Oscar Perpiñán Lamigueiro}}
\date{}
\title{Prontuario de Fórmulas\\\medskip
\large Radiación Solar}
\hypersetup{
 pdfauthor={\href{https://oscarperpinan.github.io}{Oscar Perpiñán Lamigueiro}},
 pdftitle={Prontuario de Fórmulas},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle

\section{Geometría Sol y Tierra}
\label{sec:orge8f4fe4}
\subsection{Declinación}
\label{sec:orgc4abd36}
\begin{itemize}
\item Ecuación de Cooper 
\[\delta=23,45\degree\cdot\sin\left(\frac{2\pi\cdot\left(d_{n}+284\right)}{365}\right)\]
\end{itemize}
\subsection{Hora Solar}
\label{sec:org44f1a91}
\begin{itemize}
\item Criterio de signos: \(w < 0\) antes del mediodía.
\item 1h = 15º (\(24\text{h} = 2\pi \text{ radians} = 360\))
\item (Horas) \(-12, -11, -10, \dots, -1, \textbf{0}, 1, \dots, 10, 11, 12\)
\end{itemize}

\subsection{Amanecer}
\label{sec:orge351f87}
\[
\cos(\omega_{s}) = -\tan(\delta)\tan(\phi)
\]

\subsection{Longitud del día}
\label{sec:orgc949015}
\[
|2 \cdot \omega_s  |
\]

\subsection{Cenit Solar}
\label{sec:org0c165dd}

\[
\cos(\theta_{zs}) = \cos(\delta) \cos(\omega) \cos(\phi) + \sin(\delta) \sin(\phi)
\]

\subsection{Azimut solar}
\label{sec:org8c42813}

\[
  \cos(\psi_{s}) = \mathrm{sign}(\phi) \cdot \frac{\cos(\delta) \cos(\omega) \sin(\phi) - \cos(\phi) \sin(\delta)} {\sin(\theta_{z})}
\]
\subsection{Hora solar y Hora Oficial}
\label{sec:org58cd1b4}

\[\omega=15\cdot(\mathrm{TO}-\mathrm{AO}-12)+\Delta\lambda+\frac{\mathrm{EoT}}{4}\]

\subsection{Ecuación del Tiempo}
\label{sec:orgae8ce3f}

\[
\mathrm{EoT}=229.18\cdot\left(-0.0334\cdot\sin(M)+0.04184\cdot\sin\left(2\cdot
      M+3.5884\right)\right)
\]
\[
M=\frac{2\pi}{365.24}\cdot d_{n}
\]



\section{Radiación Extra-atmosférica}
\label{sec:orgd62f467}

\begin{itemize}
\item Constante solar \(B_{0}=\SI{1367}{\watt\per\meter\squared}\)

\item Irradiancia extra-atmosférica

\[B_{0}(0)=B_{0}\cdot\epsilon_{0}\cdot\cos\theta_{zs}\]

\item Irradiación extra-atmosférica diaria  (\(\omega_{s}\) en radianes)
\[
  B_{0d}(0)=-\frac{24}{\pi}B_{0}\epsilon_{0}\cdot\left(\omega_{s}\sin\phi\sin\delta+\cos\delta\cos\phi\sin\omega_{s}\right)
\]

\item Factor de corrección por excentricidad
\[\epsilon_0 = 1+0,033\cdot\cos(2\pi d_n/365)\]
\end{itemize}


\begin{itemize}
\item Días promedio
\end{itemize}

\begin{center}
\begin{tabular}{lrrrrrrrrrrrr}
Mes & Ene & Feb & Mar & Abr & May & Jun & Jul & Ago & Sep & Oct & Nov & Dic\\
\hline
d\textsubscript{n} & 17 & 45 & 74 & 105 & 135 & 161 & 199 & 230 & 261 & 292 & 322 & 347\\
\end{tabular}
\end{center}


\section{Radiación solar en la superficie terrestre}
\label{sec:org7d1dc90}
\subsection{Caracterización de la atmósfera}
\label{sec:org374dbbe}

\begin{itemize}
\item Masa de aire
\end{itemize}

\[
   M \simeq 1/\cos\theta_{zs}
\]

\begin{itemize}
\item Índice de claridad (mensual)
\end{itemize}
\[
K_{Tm}=\frac{G_{d,m}(0)}{B_{0d,m}(0)}
\]

\begin{itemize}
\item Índice de claridad (diario)
\end{itemize}
\[
K_{Td}=\frac{G_d(0)}{B_{0d}(0)}
\]

\subsection{Estimación de Directa y Difusa}
\label{sec:orgaac5bd7}

\begin{itemize}
\item Fracción de difusa
\end{itemize}
\[
F_{D}=\frac{D(0)}{G(0)}
\]

\begin{itemize}
\item Ecuación de Page (medias mensuales)
\end{itemize}

\[
F_{Dm}=1-1.13\cdot K_{Tm}
\]
\begin{itemize}
\item Ecuación de Collares-Pereira y Rabl (valores diarios)
\end{itemize}

\[
F_{Dd} = \begin{cases}
  0.99 & K_{Td} \leq 0.17\\
  1.188 - 2.272 \cdot K_{Td} + 9.473 \cdot K_{Td}^{2} - 21.856 \cdot K_{Td}^{3} + 14.648 \cdot K_{Td}^{4} & K_{Td} > 0.17
\end{cases}
\]
\section{Bases de Datos}
\label{sec:orgdd642d2}

\subsection{Límites Físicos}
\label{sec:org50a0e8a}

\[
  K_{dT} \leq 1
\]

\[
G_d(0) \leq B_{0d}(0)
\]

\[
K_t = \frac{G_d(0)}{B_{0d}(0)} \geq 0.03
\]

\subsection{Análisis Estadístico de las Desviaciones}
\label{sec:org61d1419}

\[
MBD = \frac{1}{n} \sum_{i=1}^n (d_i)
\]

\[
RMSD = \sqrt{\frac{1}{n} \sum_{i=1}^n d_i^2} 
\]

\[
MAD = \frac{1}{n} \sum_{i=1}^n \left|d_i\right| 
\]
\section{Radiación Solar en Generadores FV}
\label{sec:org94f6b04}
\subsection{Irradiancia a partir de irradiación diaria}
\label{sec:org5367fd0}
\[D(0) = r_D \cdot D_{d}(0)\]

\[G(0) = r_G \cdot G_{d}(0)\]

\[
r_D = \frac{\pi}{24}\cdot\frac{\cos(\omega)-\cos(\omega_{s})}{\omega_{s}\cdot\cos(\omega_{s})-\sin(\omega_{s})}
\]

\[r_{G}=r_{D}\cdot\left(a+b\cdot\cos(\omega)\right)\]

\[a=0.409-0.5016\cdot\sin(\omega_{s}+\frac{\pi}{3})\]

\[b=0.6609+0.4767\cdot\sin(\omega_{s}+\frac{\pi}{3})\]
\subsection{Ángulo de incidencia en sistemas fotovoltaicos}
\label{sec:orgc201225}
\begin{itemize}
\item Sistema estático (\(\alpha=0\))
\end{itemize}
\[
\cos(\theta_{s}) = \cos(\delta)\cos(\omega)\cos(\beta-|\phi|)- \mathrm{sign}(\phi)\cdot\sin(\delta)\sin(\beta-|\phi|)
\]

\begin{itemize}
\item Seguidor 1x horizontal N-S
\end{itemize}
\[\cos(\theta_{s})=\cos(\delta)\sqrt{\sin^{2}(\omega)+\left(\cos(\omega)\cos(\phi)+\tan(\delta)\sin(\phi)\right)^{2}}\]

\begin{itemize}
\item Seguidor 2x
\end{itemize}
\[
  \cos(\theta_{s}) = 1
\]

\subsection{Transformación al plano del generador}
\label{sec:org71ad0da}


\begin{enumerate}
\item Irradiancia Directa
\label{sec:org408c873}

\[B(\beta,\alpha)=B(0)\cdot\frac{\max(0,\cos(\theta_{s}))}{\cos(\theta_{zs})}\]

\item Irradiancia Difusa
\label{sec:org8ebd345}

\begin{enumerate}
\item Modelo isotrópico
\label{sec:org3b83550}

\[D(\beta,\alpha)=D(0)\cdot\frac{1+\cos(\beta)}{2}\]


\item Modelo anisotrópico
\label{sec:orgeeb00c0}
\[D(\beta,\alpha) = D^{I}(\beta,\alpha)+D^{C}(\beta,\alpha)\]

\[D^{I}(\beta,\alpha) = D(0) \cdot (1-k_{1}) \cdot \frac{1 + \cos(\beta)}{2}\]

\[D^{C}(\beta,\alpha) = D(0) \cdot k_{1} \cdot \frac{\max(0,\cos(\theta_{s}))}{\cos(\theta_{zs})}\]

\[k_{1} = \frac{B(0)}{B_{0}(0)}\]
\end{enumerate}

\item Irradiancia de Albedo
\label{sec:orgfc5c19f}
\[R(\beta,\alpha)=\rho\cdot G(0)\cdot\frac{1-\cos(\beta)}{2}\]

\[\rho=0.2\]

\item Irradiancia Global
\label{sec:orgaf4b89f}
\[
G(\beta, \alpha) = B(\beta, \alpha) + D(\beta, \alpha) + G(\beta, \alpha)
\]
\end{enumerate}
\end{document}